index.org
#+title: Welcome
#+subtitle: Powered by Org mode with emacs
#+author: iiCodeThings
#+date: 2022-02-28 15:03:12

* Life
** Sport Summary
*** [[https://www.road-trip.cc/life/sport/science-of-running.html][Science of Running]]
*** [[https://www.road-trip.cc/life/sport/running-summary-202202.html][Running Summary-202202]]
* Study
** Emacs
*** [[https://github.com/iicodethings/emacs.git][emacs.d]]
*** Do things with emacs
1. [[https://www.road-trip.cc/study/emacs/emacs-shortcut-cheats-sheet.html][Emacs shortcut cheats sheet]]
** Programming Language
*** Emacs Lisp
* Work
** Solutions
*** [[https://www.road-trip.cc/pl/python/pip-install-m2crypto-issue.html][pip install m2crypto failed issue]]
*** [[https://www.road-trip.cc/work/solution/chrome-download-attachment-issue.html][ERR_RESPONSE_HEADERS_MULTIPLE_CONTENT_DISPOSITION]]
*** [[https://www.road-trip.cc/work/sulution/update-py3-virtualenv-pip-version.html][Update python3's virtualenv pip's version]]
#+begin_center
© 2021-2022 road-trip.cc [[https://beian.miit.gov.cn/][京ICP备2022005336号-1]] [[http://www.beian.gov.cn/portal/registerSystemInfo?recordcode=11011402012380][京公安网备11011402012380]]
#+end_center
