index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-10 Thu 14:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Welcome</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="iiCodeThings" />
</head>
<body>
<div id="content">
<h1 class="title">Welcome
<br />
<span class="subtitle">Powered by Org mode with emacs</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org80eb12d">1. Life</a>
<ul>
<li><a href="#org7319949">1.1. Sport Summary</a>
<ul>
<li><a href="#org91186b8">1.1.1. Science of Running</a></li>
<li><a href="#org0ecb8fd">1.1.2. Running Summary-202202</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6ac612f">2. Study</a>
<ul>
<li><a href="#orgaeba0b8">2.1. Emacs</a>
<ul>
<li><a href="#org638f63c">2.1.1. emacs.d</a></li>
<li><a href="#orge861568">2.1.2. Do things with emacs</a></li>
</ul>
</li>
<li><a href="#orgd53249e">2.2. Programming Language</a>
<ul>
<li><a href="#org08974de">2.2.1. Emacs Lisp</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd426fc5">3. Work</a>
<ul>
<li><a href="#org89031fe">3.1. Solutions</a>
<ul>
<li><a href="#org2ea23eb">3.1.1. pip install m2crypto failed issue</a></li>
<li><a href="#orgf68bddf">3.1.2. ERR<sub>RESPONSE</sub><sub>HEADERS</sub><sub>MULTIPLE</sub><sub>CONTENT</sub><sub>DISPOSITION</sub></a></li>
<li><a href="#org8474108">3.1.3. Update python3's virtualenv pip's version</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org80eb12d" class="outline-2">
<h2 id="org80eb12d"><span class="section-number-2">1</span> Life</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7319949" class="outline-3">
<h3 id="org7319949"><span class="section-number-3">1.1</span> Sport Summary</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org91186b8" class="outline-4">
<h4 id="org91186b8"><span class="section-number-4">1.1.1</span> <a href="https://www.road-trip.cc/life/sport/science-of-running.html">Science of Running</a></h4>
</div>
<div id="outline-container-org0ecb8fd" class="outline-4">
<h4 id="org0ecb8fd"><span class="section-number-4">1.1.2</span> <a href="https://www.road-trip.cc/life/sport/running-summary-202202.html">Running Summary-202202</a></h4>
</div>
</div>
</div>
<div id="outline-container-org6ac612f" class="outline-2">
<h2 id="org6ac612f"><span class="section-number-2">2</span> Study</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgaeba0b8" class="outline-3">
<h3 id="orgaeba0b8"><span class="section-number-3">2.1</span> Emacs</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org638f63c" class="outline-4">
<h4 id="org638f63c"><span class="section-number-4">2.1.1</span> <a href="https://github.com/iicodethings/emacs.git">emacs.d</a></h4>
</div>
<div id="outline-container-orge861568" class="outline-4">
<h4 id="orge861568"><span class="section-number-4">2.1.2</span> Do things with emacs</h4>
<div class="outline-text-4" id="text-2-1-2">
<ol class="org-ol">
<li><a href="https://www.road-trip.cc/study/emacs/emacs-shortcut-cheats-sheet.html">Emacs shortcut cheats sheet</a></li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd53249e" class="outline-3">
<h3 id="orgd53249e"><span class="section-number-3">2.2</span> Programming Language</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org08974de" class="outline-4">
<h4 id="org08974de"><span class="section-number-4">2.2.1</span> Emacs Lisp</h4>
</div>
</div>
</div>
<div id="outline-container-orgd426fc5" class="outline-2">
<h2 id="orgd426fc5"><span class="section-number-2">3</span> Work</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org89031fe" class="outline-3">
<h3 id="org89031fe"><span class="section-number-3">3.1</span> Solutions</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org2ea23eb" class="outline-4">
<h4 id="org2ea23eb"><span class="section-number-4">3.1.1</span> <a href="https://www.road-trip.cc/pl/python/pip-install-m2crypto-issue.html">pip install m2crypto failed issue</a></h4>
</div>
<div id="outline-container-orgf68bddf" class="outline-4">
<h4 id="orgf68bddf"><span class="section-number-4">3.1.2</span> <a href="https://www.road-trip.cc/work/solution/chrome-download-attachment-issue.html">ERR<sub>RESPONSE</sub><sub>HEADERS</sub><sub>MULTIPLE</sub><sub>CONTENT</sub><sub>DISPOSITION</sub></a></h4>
</div>
<div id="outline-container-org8474108" class="outline-4">
<h4 id="org8474108"><span class="section-number-4">3.1.3</span> <a href="https://www.road-trip.cc/work/solution/update-py3-virtualenv-pip-version.html">Update python3's virtualenv pip's version</a></h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-center">
<p>
© 2021-2022 road-trip.cc <a href="https://beian.miit.gov.cn/">京ICP备2022005336号-1</a> <a href="http://www.beian.gov.cn/portal/registerSystemInfo?recordcode=11011402012380">京公安网备11011402012380</a>
</p>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-02-28 15:03:12</p>
<p class="author">Author: iiCodeThings</p>
<p class="date">Created: 2022-03-10 Thu 14:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
